tests/camel-itest/src/test/resources/greetMe-reply1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://apache.org/hello_world_soap_http/types">
  <soapenv:Header/>
  <soapenv:Body>
    <typ:greetMe>
      <typ:requestType>Hello Camel</typ:requestType>
    </typ:greetMe>
  </soapenv:Body>
</soapenv:Envelope>